Nicolas7474/STM32F446_USB_CDC_HS_Driver_Bare-Metal/Sources/usb_cdc_hs.c
/***************************************************************************************************************
 **** STM32F446VET - USB OTG HS device (CDC) bare-metal implementation with DMA ****
 **** For USB3300 (ULPI lines) - Nicolas Prata / 2026 ****

- Lightweight, only two files to add to your project: usb_cdc_hs.c and usb_cdc_hs.h

- Usage:
 -  USB_OTG_HS_Connect() makes the USB device visible to the host.
    This releases the OTG HS soft-disconnect state and allows enumeration.

  - USB_OTG_HS_Disconnect() disconnects logically the device from the host without
    removing power. The USB OTG HS core enters the soft-disconnect state, causing the
    pull-up to be removed from the bus as though the physical USB cable had been unplugged.

  - Use USB_CDC_Read(dest, maxLen) to read received data from the USB CDC
    RX buffer into your application buffer.
    The function returns the number of bytes copied.
    Example: uint16_t len = USB_CDC_Read(destBuff, sizeof(destBuff));

    The internal circular RX buffer, DMA buffers and wrap-around handling
    are completely transparent to the application.
    If more data is available than fits in your application buffer,
    call USB_CDC_Read() again to consume the remaining data.
    USB_CDC_Read() automatically:
		  - handles circular-buffer wrap-around
		  - copies the received data into the application buffer
		  - releases the consumed RX data only after it has been copied
		  - re-arms EP1 OUT DMA when buffer space becomes available

  - USB_CDC_UserRxCallBack_EP1(len)
    This callback is triggered when new data has been received on EP1 OUT.
    The argument is the number of bytes received.

  - Use USB_CDC_Write(src, len) to send data to the VCOM host.
    Example: USB_CDC_Write(srcBuff, len);
    The internal TX circular buffer and USB DMA handling are completely
    transparent to the application.

  - The application does not need to access circBufferRx directly or use
    peek_circBufferRx() / commit_circBufferRx().
    These functions are private implementation details of usb_cdc_hs.c.

  - USB descriptors are defined in usb_cdc_hs.c and their declarations/constants are in usb_cdc_hs.h
*
*  Rx speed tested on my Windows 10 at a rather low 6,8 MB/s (HAL driver measured exactly the same) and Tx at 6,2 MB/s
*  Can probably be faster with another host (to be tested)
*
***********************************************************************************************************************/

#include "usb_cdc_hs.h"
#include "stm32f4xx.h"
#include "stm32f446xx.h"

/****************************************************************
 * 		RX buffers for Endpoint structure
*****************************************************************/

#define RX_BUFFER_EP0_SIZE 64U // 8 is normally enough but 64 costs almost nothing in RAM and can prevent the most common USB crashes
#define RX_BUFFER_EP1_SIZE 512 // In HS mode, the bulk OUT EP packet size (DOEPT_TRANSFER_SIZE) is defined as 512 bytes

uint8_t circBufferRx[CIRC_BUFFER_RX_SIZE];
__attribute__((aligned(4))) static uint8_t rxBufferEp0[RX_BUFFER_EP0_SIZE]; /* Received data is stored here after application reads DFIFO. RX FIFO is shared */


/**********************************************************************
 * 	The application will set linecoding according to the host request
 ***********************************************************************/
/* Since you are overwriting lineCoding[7], the static uint8_t lineCoding initialization can be simplified to just zeros,
   or the standard "115200, 8-N-1" default : 115200 (0x0001C200), 1 Stop bit (0), No Parity (0), 8 Data bits (8)
*/
__attribute__((aligned(4))) static uint8_t lineCoding[7] = {0x00, 0xC2, 0x01, 0x00, 0x00, 0x00, 0x08};

/* USB descriptors are defined here (not in the header) so they are stored only once. */
/* Device string descriptor */
const uint8_t deviceDescriptor [DEVICE_DESCRIPTOR_LENGTH] __attribute__((aligned(4))) = {
	DEVICE_DESCRIPTOR_LENGTH, //
	0x01, /* Descriptor type - device */
	0x00, /* 0x0110 = usb 1.1 ; 0x0200 = usb 2.0 */
	0x02,
	0x00, /* Class information is specified at the interface level */
	0x00, /* Subclass */
	0x00, /* Protocol */
	EP0_SIZE, /* EP0 size */
	LOBYTE(USBD_VID),
	HIBYTE(USBD_VID),
	LOBYTE(USBD_PID_HS),
	HIBYTE(USBD_PID_HS),
	0x00, /* ver. (BCD) */
	0x02, /* ver. (BCD) */
	0x01, /* Manufactor string index */
	0x02, /* Product string index */
	0x03, /* Serial number string index */
	1 /* configuration count */
};

/* Configuration descriptor */
const uint8_t configurationDescriptor [CONFIGURATION_DESCRIPTOR_LENGTH] __attribute__((aligned(4))) = {
	// EP0 being the mandatory "Default Control Pipe" for all USB devices, it is never declared in the Configuration Descriptor.
	/*Configuration Descriptor*/
	0x09,   /* bLength: Configuration Descriptor size */
	0x02,      /* bDescriptorType: Configuration */
	CONFIGURATION_DESCRIPTOR_LENGTH,                /* wTotalLength:no of returned bytes */
	0x00,
	0x02,   /* bNumInterfaces: 2 interface */
	0x01,   /* bConfigurationValue: Configuration value */
	0x00,   /* iConfiguration: Index of string descriptor describing the configuration */
	0xC0,   /* bmAttributes: self powered */
	0xC8,   /* MaxPower 400 mA */

	/*---------------------------------------------------------------------------*/
    /* Interface Association Descriptor (IAD) - Multi-Interface Single Functions:
	CDC-ACM class inherently split functionality across two separate interfaces (a Communication Control interface and a Data interface).
	The IAD tells the host that these contiguous interfaces belong together as a single logical unit. */
    0x08,
    0x0B,
    0x00,
    0x02,
    0x02,
    0x02,
    0x01,
    0x00,
	/*---------------------------------------------------------------------------*/

	/*Interface 0 Descriptor */
	0x09,   /* bLength: Interface Descriptor size */
	0x04,  /*  bDescriptorType: Interface */
	0x00,   /* bInterfaceNumber: Number of Interface */
	0x00,   /* bAlternateSetting: Alternate setting */
	0x01,   /* bNumEndpoints: one CDC notification IN endpoint (EP2) */
	0x02,   /* bInterfaceClass: Communication Interface Class */
	0x02,   /* bInterfaceSubClass: Abstract Control Model */
	0x01,   /* bInterfaceProtocol: Common AT Commands (CDC ACM) */
	0x00,   /* iInterface: */

	/*Header Functional Descriptor*/
	0x05,   /* bLength: Endpoint Descriptor size */
	0x24,   /* bDescriptorType: CS_INTERFACE */
	0x00,   /* bDescriptorSubtype: Header Func Desc */
	0x10,   /* bcdCDC: spec release number */
	0x01,

	/*Call Management Functional Descriptor*/
	0x05,   /* bFunctionLength */
	0x24,   /* bDescriptorType: CS_INTERFACE */
	0x01,   /* bDescriptorSubtype: Call Management Func Desc */
	0x00,   /* bmCapabilities */
	0x01,   /* bDataInterface: 1 */

	/*ACM Functional Descriptor*/
	0x04,   /* bFunctionLength */
	0x24,   /* bDescriptorType: CS_INTERFACE */
	0x02,   /* bDescriptorSubtype: Abstract Control Management desc */
	0x02,   /* bmCapabilities */

	/*Union Functional Descriptor*/
	0x05,   /* bFunctionLength */
	0x24,   /* bDescriptorType: CS_INTERFACE */
	0x06,   /* bDescriptorSubtype: Union func desc */
	0x00,   /* bMasterInterface: Communication class interface */
	0x01,   /* bSlaveInterface0: Data Class Interface */

	/* CDC notification endpoint (required by the CDC ACM communication interface).
	 * EP2 IN is intentionally stalled by the current application, but still implemented
	 * since it is part of the CDC ACM implementation requirements. The endpoint is configured
	 * in hardware and can be un-stalled and un-Naked if needed. */
	0x07,   /* bLength */
	0x05,   /* bDescriptorType: Endpoint */
	(0x80U | USB_CDC_NOTIFICATION_EP),   /* bEndpointAddress: EP2 IN */
	0x03,   /* bmAttributes: Interrupt */
	LOBYTE(USB_CDC_NOTIFICATION_MPS),
	HIBYTE(USB_CDC_NOTIFICATION_MPS),
	USB_CDC_NOTIFICATION_INTERVAL,

