Nicolas7474/STM32F446_USB_CDC_HS_Driver_Bare-Metal/Sources/usb_cdc_hs.c
}

 /**
 * brief  Flush TxFifo
 * param  Fifo number, 10 = all Tx Fifos,
 * param  timeout (default FLUSH_FIFO_TIMEOUT)
 * retval 1 = OK, 0 = Failed
 */
uint32_t USB_FlushTxFifo(uint32_t EPnum, uint32_t timeout){
	uint32_t count = 0;
	USB_OTG_HS->GRSTCTL = (USB_OTG_GRSTCTL_TXFFLSH | (EPnum << 6));
	do{
		if (++count > timeout){
			return EP_FAILED;
		}
	}
	while ((USB_OTG_HS->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH) == USB_OTG_GRSTCTL_TXFFLSH);

	 return EP_OK;
}

 /**
 * brief  Flush RxFifo
 * param  timeout (default FLUSH_FIFO_TIMEOUT)
 * param
 * retval 1 = OK, 0 = Failed
 */
uint32_t USB_FlushRxFifo(uint32_t timeout){
	uint32_t count = 0;
	USB_OTG_HS->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH;
	do{
		if (++count > timeout){
			return EP_FAILED;
		}
	}
	while ((USB_OTG_HS->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH) == USB_OTG_GRSTCTL_RXFFLSH);

	return EP_OK;
}

/****************************************************
* 		EndPoints' Callbacks*
***************************************************/

/**
* This Callback function is where the high-level logic meets the actual hardware registers.
* Take a buffer of any size, chop it into USB-compliant packets, and manage the ZLP logic required by the USB specification
* Atomic-Style Execution: Because you'll call this from the scheduler inside a __disable_irq() block, the registers are set,
* the DMA transfer is programmed and the hardware is ready before any other part of your code can interfere.
* brief  check Endpoint TX status
* param  EP number
* retval
*/
uint32_t USB_CDC_transferTXCallback(uint8_t EPnum){
    // 1. Wait for Hardware Readiness
    uint32_t start_tick = GetSysTick();
    while(USB_EP_IN(EPnum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA) {
    	if (GetSysTick() - start_tick > 5) return EP_FAILED;
    }

    uint16_t len = EndPoint[EPnum].txCounter;

    if (EPnum == 0) {
    	/* CONTROL HANDSHAKE / DESCRIPTORS - DMA-driven */
    	// Calculate packets: (67 + 63) / 64 = 2 packets
    	uint32_t pktcnt = (len == 0) ? 1 : (len + MAX_CDC_EP0_TX_SIZ - 1) / MAX_CDC_EP0_TX_SIZ;

    	// Hardware setup for exactly what is in the buffer
    	// DIEPTSIZ: [PKTCNT (bits 20:19)] | [XFRSIZ (bits 18:0)]
    	USB_EP_IN(0)->DIEPTSIZ = (pktcnt << 19) | len;

    	// 2. Point DMA engine directly to the control buffer source address
    	USB_EP_IN(0)->DIEPDMA = (uint32_t)(EndPoint[0].txBuffer_ptr);
     	//__DMB();
    	// 3. Arm EP and trigger the hardware DMA transfer immediately across the AHB bus
    	USB_EP_IN(0)->DIEPCTL |= (USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA);
    }
    else {
    	/* DATA EP1 - DMA MODE */
    	EndPoint[1].statusTx = EP_BUSY;
    	EndPoint[1].totXferLen = len;

    	uint32_t total = len;
    	uint32_t pktcnt = (total == 0) ? 1 : (total + (MAX_CDC_EP1_TX_SIZ - 1)) / MAX_CDC_EP1_TX_SIZ;

    	// 1. Configure Transfer Size and Packet Count
    	USB_EP_IN(EPnum)->DIEPTSIZ = (pktcnt << 19) | total;

    	// 2. Point DMA engine directly to the source buffer (must be 32-bit aligned)
    	// Note: EndPoint[EPnum].txBuffer_ptr points to the aligned EP1 DMA staging buffer.
    	// You supply the exact source pointer address:
    	USB_EP_IN(EPnum)->DIEPDMA = (uint32_t)(EndPoint[EPnum].txBuffer_ptr);
    	//__DMB();
    	// 3. Arm EP and trigger the hardware DMA transfer (firing the endpoint enable EPENA) immediately across the AHB bus
    	USB_EP_IN(EPnum)->DIEPCTL |= (USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA);
    	// No manual FIFO servicing is needed: the hardware DMA engine streams the whole payload directly from RAM
    }
    return EP_OK;
}


/*
 * brief  Set and start TX transaction
* param  EP number, TX Buffer, length
* retval OK/FAILED
*/
uint32_t USB_CDC_setTxBuffer(uint8_t EPnum, uint8_t *txBuff, uint16_t len){

	/************** Safety check - Previous transaction is not finished ****************/
	if((EndPoint[EPnum].txCounter != 0) || (EndPoint[EPnum].statusTx == EP_ZLP)
										|| (check_USB_device_status(DEVICE_STATE_TX_PR) == EP_OK)) {
		return EP_FAILED;
	}

	/* Set data to send */
	if(len != 0){
		EndPoint[EPnum].txBuffer_ptr = txBuff; 	// *txBuff points to the first index to read on the circular buffer
		EndPoint[EPnum].txCounter = len; //
		/* SEND DATA (calling USB_CDC_transferTXCallback) */
		set_device_status(DEVICE_STATE_TX_PR);
		EndPoint[EPnum].txCallBack(EPnum);

		/* DMA owns the complete transfer; no TX FIFO-empty interrupt is required. */
		return EP_OK;
	}
	/* Zero-Length Packet (with EP0 after enumerate_Setup() send a zlp ACK) */
	else {
		// 1. Clear out any previous state (optional but safer in Turbo)
		USB_EP_IN(EPnum)->DIEPINT = 0xFF;
		// 2. Set SIZES FIRST (One single write)
		// This sets PKTCNT=1 and XFRSIZ=0 in one bus cycle
		USB_EP_IN(EPnum)->DIEPTSIZ = (1 << USB_OTG_DIEPTSIZ_PKTCNT_Pos);
		// 3. ENABLE LAST
		// This is the only time you should touch EPENA in this block
		USB_EP_IN(EPnum)->DIEPCTL |= (USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA);
		// 4. Arm the OUT endpoint
		USB_EP_OUT(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
		return EP_OK;
	}
}

/**
* brief  Perform some action with recieved data (EP0) and refresh EP buffer counter
* brief  For EP0 - Set lineCoding
* param  command
* retval
*/
uint32_t USB_CDC_transferRXCallback_EP0(uint32_t param)
{
    uint16_t len = EndPoint[0].rxCounter;

    if ((param != CDC_SET_LINE_CODING) || (len != CDC_LINE_CODING_LENGTH)) 	return EP_OK;

    // Do not apply other safety guards here like if (len == 0), or it will disrupt ("incomplete") the Setup phase

    // Overwrite our variable lineCoding with whatever the PC sent (7 bytes)
    memcpy(lineCoding, rxBufferEp0, CDC_LINE_CODING_LENGTH);

    EndPoint[0].rxCounter = 0; // Clear the counter so we don't process the same data twice.
    EndPoint[0].setTxBuffer(0, NULL, 0); // The OUT data stage is complete. Now send the required IN ZLP status stage for the control transfer
    return EP_OK;
}



/**
* brief  Perform some action with received data (EP1) and refresh EP buffer counter
* param  a command or a dummy param
* param
* retval
*/
uint32_t USB_CDC_transferRXCallback_EP1(uint32_t param){

