Nicolas7474/STM32F446_USB_CDC_HS_Driver_Bare-Metal/Sources/usb_cdc_hs.c
	EndPoint[0].setTxBuffer(0, dest, len); // must be sent even if len == 0
}

/**
 * brief  Schedule a new transmission after a previous one finished
 * retval EP_FAILED if conditions are not met
 */
uint32_t USB_CDC_transmit_scheduler(){

	// if we are in the process of sending multiple packets or if Fifo is ready
	if(is_tx_ep_ready(1) == EP_OK) {
		if(!is_circBufferTx_empty())
		{
			// set the length of the string to send by peeking at the ring buffer
			circBufferAddress newMsgaddr = peek_circBufferTx(MAX_CDC_EP1_TX_SIZ); // MAX_CDC_EP1_TX_SIZ =
			if (newMsgaddr.len == 0) return EP_READY ;

			/*
			 * Save the transaction information. The circular-buffer read
			 * pointer is committed only after the USB DMA transfer completes.
			 */
			ep1TxPendingLen = newMsgaddr.len;

			/*
			 * DMA source must be 32-bit aligned. The circular-buffer index
			 * may point to any byte, so copy the contiguous chunk to the
			 * always-aligned staging buffer first.
			 */
			memcpy(ep1TxDmaBuffer,
			       &circBufferTx[newMsgaddr.index],
			       newMsgaddr.len);

			EndPoint[1].setTxBuffer(1, ep1TxDmaBuffer, newMsgaddr.len); // EndPoint[i].setTxBuffer = &USB_CDC_setTxBuffer;
			return EP_OK;
		}
	}
	return EP_FAILED;
}


/************************************************************/
/*************************** inline *************************/
/************************************************************/

/* Device status functions. Set/clear/check*/

static inline void set_device_status(eDeviceState state){
	device_state |= state;
}

void clear_USB_device_status(eDeviceState state){
	device_state &= ~state;
}

uint32_t check_USB_device_status(eDeviceState state){
	if(device_state & state){
		return EP_OK;
	}
	else return EP_FAILED;
}

/**
* brief  Check if TX FIFO is ready to push there data
* param  EP number
* param  param. If you use TX queue, "param" would be message count var pending in the queue
* param  if you have a var like message_counter, you use it here, otherwise use something > 0
* retval
*/

static inline uint32_t is_tx_ep_ready(uint8_t EPnum){
	if (!(device_state & DEVICE_STATE_TX_PR) &&
		!(USB_EP_IN(EPnum)->DIEPTSIZ & USB_OTG_DIEPTSIZ_XFRSIZ) &&
		((USB_EP_IN(EPnum)->DIEPTSIZ & USB_OTG_HCTSIZ_PKTCNT) == 0) &&
		!(USB_EP_IN(EPnum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)) {
		return EP_OK;
	}
	else return EP_FAILED;
}

/*************************** End of inline functions *************************/


/* User function for sending data */
// TODO NON BLOCKING Version
uint32_t USB_CDC_Write(uint8_t *txBuff, uint16_t len){

	uint32_t start_tick = GetSysTick(); // Custom timer

	if (len == 0) return EP_OK;

	/* - "get_circBufferTx_freeSize() < len", if the Main Loop is faster than the USB, the while loop slows it down, preventing accidental overwriting of the buffer
	   - "EndPoint[1].statusTx != EP_READY", when you use an if, you might miss the "opening" of a frame and have to wait for the next loop. With the while,
	   you are hitting the hardware the microsecond it becomes available. Most importantly, without this instruction, USB_CDC_send_data() simply won't work
	   in a loop, or only with slowing down the loop, because EndPoint[1].statusTx will most often remain on EP_BUSY (latency synchronization issue).
	*/
	while (EndPoint[1].statusTx != EP_READY || get_circBufferTx_freeSize() < len) {
		// blocking wait with small 6ms timeout for less impact on global flow (interrupts are not disabled for this function so we can use SystTick)
		if (GetSysTick() - start_tick > 5) {
			return EP_FAILED;
		}
	}

	uint16_t sentBytes = 0;

	while (sentBytes < len) {

		if (GetSysTick() - start_tick > 30) { // 30ms timeout
			USB_CDC_ForceResetState();
			return EP_FAILED;
		}
		uint16_t freeSize = get_circBufferTx_freeSize(); // if empty size = CIRC_BUFFER_TX_SIZE

		if (freeSize > 1) {
			// Note: if(freeSize > 0): if freeSize=1, chunk becomes 0 -> sentBytes += chunk does nothing, and the while() will spin forever until the timeout hits
			// Calculate how much we can actually fit right now
			uint16_t chunk = (len - sentBytes);
			if (chunk > freeSize) chunk = freeSize;
			write_to_circBufferTx(&txBuff[sentBytes], chunk);
			sentBytes += chunk;

			/* Since you are using the circular buffer to bridge the Main Loop (Producer) and the ISR (Consumer), you need to ensure they don't
			step on each other's toes. Whenever you call the scheduler from the "outside" (the Main Loop), wrap it in a brief interrupt disable.
			By checking both the hardware bit (EPENA) and your software flag (statusTx) inside the disabled-interrupt zone, you create a "Hard Lock."
			It is physically impossible for the packets to mix because the Main Loop will see that the hardware is busy and simply walk away,
			knowing the ISR will pick up the remaining data in the circular buffer as soon as the current packet finishes.
			*/
			__disable_irq();
			if (!(USB_EP_IN(1)->DIEPCTL & USB_OTG_DIEPCTL_EPENA) && (EndPoint[1].statusTx == EP_READY)) {
				USB_CDC_transmit_scheduler(); // will read circular buffer and prepare transfer
			}
			__enable_irq();
		}
	}
	return EP_OK;
}

/* it is recommended to store RX data in a buffer and process the data in a main loop or separated task */
__WEAK uint32_t USB_CDC_UserRxCallBack_EP1(uint16_t length){

	return length;
}



/*********************************************************************************/
/**************************  Application-facing USB CDC functions  ***************/
/*********************************************************************************/

uint16_t USB_CDC_Read(uint8_t *dest, uint16_t maxLen)
{

	uint16_t total = 0;

    while (total < maxLen)
    {
        circBufferAddress data;

        /* peek_circBufferRx() returns only a contiguous block and does not advance readPtrRxCbuf */
        data = peek_circBufferRx(maxLen - total);

        if (data.len == 0)
            break;

        memcpy(dest + total,
               &circBufferRx[data.index],
               data.len);

